# BuildingOpeningTimeParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BuildingOpeningTimeParam Property
ParameterTypeId Class See Also
---
"Opening Time"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BuildingOpeningTimeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BuildingOpeningTimeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BuildingOpeningTimeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace